/**/
"Cancel" = "Annulla";
/**/
"Delete" = "Elimina";
/**/
"Open" = "Apri";
/**/
"Edit" = "Modifica";
/**/
"Yes" = "Sì";
/**/
"Finish" = "Fine";
/**/
"Done" = "Fine";
/**/
"Save" = "Salva";
/**/
"Undo" = "Annulla";
/**/
"Redo" = "Ripeti";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Sì, elimina";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Applica geometria";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Cancella geometria";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Elimina vertice";
/*Geometry Edit Action Name*/
"Insert Part" = "Inserisci parte";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Inserisci vertice";
/*Geometry Edit Action Name*/
"Move Vertex" = "Sposta vertice";
/*Geometry Edit Action Name*/
"Remove Part" = "Rimuovi parte";

/*Collecting attachments*/
"Add" = "Aggiungi";
/*Collecting attachments*/
"Take Photo or Video" = "Acquisisci foto o video";
/*Collecting attachments*/
"Choose From Library" = "Scegli da Raccolta";
/*Collecting attachments*/
"Photo" = "Foto";
/*Collecting attachments*/
"Video" = "Video";
/*Collecting attachments*/
"Save To Photo Library" = "Salva nella Raccolta foto";
/*Collecting attachments*/
"Download" = "Scarica";

/*Date attribute*/
"Today" = "Oggi";

/**/
"Attachments" = "Allegati";
"Attributes" = "Attributi";

/**/
"Open in Safari" = "Apri in Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Inserire un numero compreso tra %i e %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Inserire un numero compreso tra %@ e %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Troppi caratteri (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Valore non compreso nell'intervallo consentito.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Tipo di campo non supportato";

/**/
"%d of %d" = "%d di %d";

/**/
"Changing Feature Type" = "Modifica tipo di feature";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Si sta modificando il tipo di feature e ciò potrebbe sovrascrivere alcuni valori di campi. Continuare?";

/**/
"Deleting Feature" = "Eliminazione feature";
"Are you sure you want to delete this feature?" = "Eliminare la feature?";

/**/
"Data for pie chart is invalid" = "I dati per il grafico a torta non sono validi";
"No data to create a pie chart" = "Non sono disponibili dati per creare un grafico a torta";
"No image to display" = "Nessuna immagine da visualizzare";

/**/
"Created by %@ seconds ago" = "Creato da %@ qualche secondo fa";

/**/
"Created by %@ a minute ago" = "Creato da %@ un minuto fa";

/**/
"Edited by %@ seconds ago" = "Modificato da %@ qualche secondo fa";

/**/
"Edited by %@ a minute ago" = "Modificato da %@ un minuto fa";

/**/
"Created seconds ago" = "Creato qualche secondo fa";

/**/
"Created a minute ago" = "Creato un minuto fa";

/**/
"Edited seconds ago" = "Modificato qualche secondo fa";

/**/
"Edited a minute ago" = "Modificato un minuto fa";

/**/
"Created by %@ %d minutes ago" = "Creato da %@ %d minuti fa";

/**/
"Created by %@ an hour ago" = "Creato da %@ un'ora fa";

/**/
"Created by %@ %d hours ago" = "Creato da %@ %d ore fa";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Creato da %@ il giorno %@ alle ore %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Creato da %@ il giorno %@ alle ore %@";

/**/
"Edited by %@ %d minutes ago" = "Modificato da %@ %d minuti fa";

/**/
"Edited by %@ an hour ago" = "Modificato da %@ un'ora fa";

/**/
"Edited by %@ %d hours ago" = "Modificato da %@ %d ore fa";

/**/
"Edited by %@ on %@ at %@ - day" = "Modificato da %@ il giorno %@ alle ore %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Modificato da %@ il giorno %@ alle ore %@";

/**/
"Created by %@" = "Creato da %@";

/**/
"Edited by %@" = "Modificato da %@";

/**/
"Created %d minutes ago" = "Creato %d minuti fa";

/**/
"Created an hour ago" = "Creato un'ora fa";

/**/
"Created %d hours ago" = "Creato %d ore fa";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Creato il giorno %@ alle ore %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Creato il giorno %@ alle ore %@";

/**/
"Edited %d minutes ago" = "Modificato %d minuti fa";

/**/
"Edited an hour ago" = "Modificato un'ora fa";

/**/
"Edited %d hours ago" = "Modificato %d ore fa";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Modificato il giorno %@ alle ore %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Modificato il giorno %@ alle ore %@";

/* Used to denote a required field */
"Required" = "Obbligatorio";

/* Used for naming layers with no names */
"Layer %d" = "Layer %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Impossibile trovare l\\'indirizzo relativo alla posizione";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Impossibile trovare la posizione relativa all\\'indirizzo";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Impossibile leggere l\\'indirizzo";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "File non trovato";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Impossibile caricare il localizzatore";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Errore interno del localizzatore";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "La geocodifica di intersezione non è supportata dal localizzatore";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Proprietà localizzatore non valide";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Campo obbligatorio mancante";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Il localizzatore non è inizializzato";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Formato del localizzatore non supportato";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Trasformazione di proiezione non supportata";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Riferimento spaziale non supportato";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Geocodifica inversa non supportata da questo localizzatore.";

/* Network analyst errors */
"Cannot open network." = "Impossibile aprire la rete.";
"Cannot retrieve route task parameters." = "Impossibile recuperare i parametri dell\\'attività di itinerario.";
"Insufficient number of stops." = "Numero insufficiente di fermate.";
"Stop (%@) was not located." = "Impossibile individuare la fermata (%@).";
"Stop (%@) is located on a non traversable element." = "La fermata (%@) è stata individuata su un elemento non attraversabile.";
"Stop (%@) is located on a soft restricted element." = "La fermata (%@) è stata individuata su un elemento soggetto a restrizioni provvisorie.";
"Point barrier (%@) was not located." = "Impossibile individuare la barriera punto (%@).";
"Point barrier (%@) has invalid added cost attribute name." = "La barriera punto (%@) dispone di un nome di attributo di costo aggiunto non valido.";
"Line barrier (%@) has invalid scaled cost attribute name." = "La barriera linea (%@) dispone di un nome di attributo di costo scalato non valido.";
"Line barrier (%@) does not cover any network elements." = "La barriera linea (%@) non copre nessun elemento della rete.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "La barriera poligono (%@) dispone di un nome di attributo di costo scalato non valido.";
"Polygon barrier (%@) does not cover any network elements." = "La barriera poligono (%@) non copre nessun elemento della rete.";
"'%@' is an invalid impedance attribute." = "'%@' è un attributo di impedenza non valido.";
"'%@' restriction attribute is invalid." = "L'attributo di restrizione '%@' non è valido.";
"'%@' accumulate attribute is invalid." = "L'attributo di accumulazione '%@' non è valido.";
"'%@' is an invalid directions time attribute." = "'%@' è un attributo tempo direzioni non valido.";
"Directions distance attribute is invalid." = "L'attributo distanza direzioni non è valido.";
"Invalid attribute parameter attribute name (%@)." = "Nome di attributo del parametro di attributo (%@) non valido.";
"Invalid attribute parameter parameter name (%@)." = "Nome di parametro del parametro di attributo (%@) non valido.";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Tipo di valore per il parametro (%2$@) dell\\'attributo (%1$@) non valido.";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valore di utilizzo della restrizione per il parametro (%2$@) dell\\'attributo (%1$@) non valido.";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valore di utilizzo della restrizione per il parametro (%2$@) dell\\'attributo (%1$@) neutrale.";
"Soft restricted element (%@) was traversed." = "L'elemento soggetto a restrizioni provvisorie (%@) è stato attraversato.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "La rete non dispone dell\\'attributo di gerarchia per l'esecuzione della pianificazione dell\\'itinerario gerarchica.";
"No path can be found between a given pair of stops (%@)." = "Impossibile trovare nessun percorso compreso tra la coppia di fermate fornita (%@).";
"The input spatial reference is undefined." = "Il riferimento spaziale di input è indefinito.";
"The output spatial reference is undefined." = "Il riferimento spaziale di output è indefinito.";
"The directions style is invalid." = "Lo stile delle direzioni non è valido.";
"The directions language is invalid." = "La lingua delle direzioni non è valida.";
"Directions time and distance attributes do not match." = "Gli attributi di tempo e distanza delle direzioni non corrispondono.";
"The directions road class attribute is invalid." = "L'attributo classi strade direzioni non è valido.";
"Unknown condition." = "Condizione sconosciuta.";
"Invalid route task parameters." = "Parametri attività di itinerario non validi.";
"Route task's solution cannot be found." = "Impossibile trovare la soluzione dell'attività di itinerario.";
"Route task was cancelled." = "L'attività di itinerario è stata annullata.";
"Route task internal error." = "Errore interno dell\\'attività di itinerario.";
"Route name property is not supported for local route task." = "La proprietà dell\\'attività di itinerario non è supportata dall\\'attività di itinerario locale.";
"Local route task parameters should be retrieved from route task." = "È necessario recuperare i parametri dell\\'attività di itinerario locale dall\\'attività di itinerario.";
"Cannot retrieve network description." = "Impossibile recuperare la descrizione di rete.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "È possibile specificare soltanto un attributo di lunghezza per il nome di attributo di impedenza e per i nomi di attributo di accumulazione.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "È possibile specificare soltanto un attributo di tempo per il nome di attributo di impedenza e per i nomi di attributo di accumulazione.";
"Service not supported." = "Servizio non supportato.";
"Specified start time occurs before January 1, 1970." = "L'ora di inizio specificata risale a prima del 1° gennaio 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "L'ora di inizio della fermata (%@) risale a prima del 1° gennaio 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "La finestra temporale locale della fermata (%@) risale a prima del 1° gennaio 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "La finestra temporale UTC della fermata (%@) risale a prima del 1° gennaio 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "La fine della finestra temporale della fermata (%@) risale a prima dell'inizio.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Sconosciuto";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centimetri";
"Decimal Degrees" = "Gradi decimali";
"Decimeters" = "Decimetri";
"Feet" = "Piedi";
"Inches" = "Pollici";
"Kilometers" = "Chilometri";
"Meters" = "Metri";
"Miles" = "Miglia";
"Millimeters" = "Millimetri";
"Nautical Miles" = "Miglia nautiche";
"Points" = "Punti";
"Yards" = "Iarda";

/* Area Units Abbreviated Strings */
"sq. in" = "in²";
"sq. ft" = "ft²";
"sq. yd" = "yd²";
"ac" = "ac";
"sq. mi" = "mi²";
"sq. mm" = "mm²";
"sq. cm" = "cm²";
"sq. dm" = "dm²";
"sq. m" = "m²";
"ares" = "a.";
"ha" = "ha";
"sq. km" = "km²";

/* Area Units Display Strings */
"Square Inches" = "Pollici quadrati";
"Square Feet" = "Piedi quadri";
"Square Yards" = "Iarde quadrate";
"Acres" = "Acri";
"Square Miles" = "Miglia quadre";
"Square Millimeters" = "Millimetri quadrati";
"Square Centimeters" = "Centimetri quadrati";
"Square Decimeters" = "Decimetri quadrati";
"Square Meters" = "Metri quadri";
"Ares" = "Are";
"Hectares" = "Ettari";
"Square Kilometers" = "Chilometri quadri";

/* Errors */
"Error" = "Errore";
"Class not @protocol AGSCoding compliant" = "Classe non conforme a @protocol AGSCoding";
"Authorization required" = "Autorizzazione richiesta";
"Token is invalid or has expired" = "Token non valido o scaduto";
"Unknown error occurred" = "Errore sconosciuto";
"Empty username/password" = "Nome utente/password non specificato";
"Token URL is nil. You must set a valid token URL on the credential." = "URL di token null. È necessario impostare un URL di token valido nelle credenziali.";
"Unknown authentication error" = "Errore di autenticazione sconosciuto";
"Error extracting identity" = "Errore durante l'estrazione dell'identità";
"Error adding identity to the keychain" = "Errore durante l'aggiunta dell'identità al portachiavi";
"Invalid Credentials" = "Credenziali non valide";
"Bad URL." = "URL errato.";
"The feature layer does not expose an object-id field." = "Il layer di feature non espone un campo ID oggetto.";
"Both geodatabase and syncParams are required for this method." = "Per questo metodo sono richiesti sia geodatabase che syncParams.";
"Uploading deltas is not supported with this replica." = "Il caricamento delle differenze non è supportato con questo geodatabase abilitato alla sincronizzazione.";
"Error creating delta geodatabase" = "Errore durante la creazione del geodatabase delle differenze";
"Unable to create result image layer" = "Impossibile creare il layer dell'immagine risultato";
"Cache at path '%@' not found." = "Cache non trovata nel percorso '%@'.";
"To add an item, you must be logged in to the portal." = "Per aggiungere un elemento. è necessario essere connessi al Portale.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Per aggiungere un elemento, è necessario specificare un valore in AGSPortalItemContentParameters.";
"The portal failed to add the item." = "Il Portale non è riuscito ad aggiungere l'elemento.";
"To delete an item, you must be logged in to the portal." = "Per eliminare un elemento, è necessario essere connessi al Portale.";
"The portal failed to delete the item." = "Il Portale non è riuscito a eliminare l'elemento.";
"To update an item, an itemId and logged in user are required." = "Per aggiornare un elemento, sono necessari un itemId e un utente connesso.";
"The item failed to update." = "L'elemento non è stato aggiornato.";
"The item failed to update JSON." = "L'elemento non è riuscito ad aggiornare JSON.";
"You must be logged in to a portal to add a comment." = "Per aggiungere un commento, è necessario essere connessi a un Portale.";
"The comment failed to be added." = "Il commento non è stato aggiunto.";
"You must be logged in to a portal to fetch the current user's rating." = "Per recuperare la valutazione dell'utente corrente, è necessario essere connessi a un Portale.";
"You must be logged in to a portal to add a rating." = "Per aggiungere una valutazione, è necessario essere connessi a un Portale.";
"The rating failed to be added." = "La valutazione non è stata aggiunta.";
"To share an item, you must be logged in to the portal." = "Per condividere un elemento, è necessario essere connessi al Portale.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Per rimuovere la condivisione per un elemento, è necessario essere connessi al Portale e specificare i gruppi per cui rimuovere la condivisione.";
"Bad Request" = "Richiesta errata";
"Credential Required" = "AGSCredential obbligatorio";
"Job not created" = "Processo non creato";
"Service did not return a valid URL" = "Il servizio non ha restituito un URL valido";
"Service did not return a file" = "Il servizio non ha restituito un file";
"Service did not return a size" = "Il servizio non ha restituito una dimensione";
"Job failed" = "Processo non riuscito";
"Job timed out" = "Timeout processo";
"Job was cancelled" = "Processo annullato";
"Job was deleted" = "Processo eliminato";
"Feature with objectId: %d not found" = "Feature con objectId %d non trovato";
"No object-id values specified for feature table query." = "Valore object-id non specificato per l'interrogazione sulla tabella feature.";
"Geodatbase at path '%@' not found." = "Geodatabase nel percorso '%@' non trovato.";
"An error occured when creating the local Geodatabase" = "Errore durante la creazione del geodatabase locale";
"Operation not supported for Geodatabase Feature Service Table" = "Operazione non supportata per la tabella del servizio feature del geodatabase";

/* OAuth */
"The specified clientID is invalid" = "Il clientID specificato non è valido";
"Log In" = "Accedi";

/* Sync */
"Upload is not supported with this service." = "Caricamento non supportato con questo servizio.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Per chiamare la sincronizzazione è necessario specificare una direzione di sincronizzazione diversa da AGSGDBSyncDirectionNone.";